# 2) მომხმარებელს სთხოვე შეიყვანოს თავისი ასაკი და მიუთითოს, აქვს თუ არა სტუდენტური ბარათი.
# შემდეგ:
# თუ ასაკი ნაკლებია 18-ზე ან სტუდენტური ბარათი აქვს → დაბეჭდე "დანაზოგი გაქვს!"
# თუ ასაკი 60 ან მეტია და არ აქვს ბარათი → დაბეჭდე "პენსიონერის ფასდაკლება გაქვს!"
# სხვა შემთხვევაში → "ფასდაკლება არ გეკუთვნის.


age = int(input("Enter your age: "))
have_card = input("Do u have student card? :")


if age < 18 or have_card == "yes":
    print("დანაზოგი გაქვს")

else:
    print("ფასდაკლება არ გეკუთვნის.")

age2 = int(input("Enter your age: "))
have_card2 = input("Do u have student card? :")


if age2 < 60 or age2 == 60 and have_card2 == "no":
    print("პენსიონერის ფასდაკლება გაქვს!")

else:
    print("ფასდაკლება არ გეკუთვნის.")